#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = НачалоНедели(ТекущаяДата());
	КонецПериода = КонецНедели(ТекущаяДата());
	
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(НачалоПериода, КонецПериода);
	
	ОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	ОбновитьПланировщикНаСервере();
	
КонецПроцедуры  

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_ВКМ_ОбслуживаниеКлиента" Тогда
		
		ОбновитьПланировщикНаСервере(); 
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ОбновитьПланировщикНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
	               |	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	               |	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	               |	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	               |	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
	               |	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан,
	               |	ВКМ_ОбслуживаниеКлиента.Проведен КАК Проведен,
	               |	ВКМ_ОбслуживаниеКлиента.Номер КАК Номер,
	               |	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |ГДЕ
	               |	НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
	               |	И НЕ ВКМ_ОбслуживаниеКлиента.Проведен";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачалоПериода = НачалоНедели(ТекущаяДата());
	КонецПериода = КонецНедели(ТекущаяДата());
	
	Планировщик.Элементы.Очистить();
	
	ОбслуживаниеКлиентов = Документы.ВКМ_ОбслуживаниеКлиента.Выбрать(НачалоПериода, КонецПериода);
	
	Пока Выборка.Следующий() Цикл
		
		УсловнаяПродолжительность = (Выборка.ВремяОкончанияРаботПлан - Выборка.ВремяНачалаРаботПлан);
		Время = Выборка.ВремяНачалаРаботПлан - Дата(1, 1, 1) ;
		НачалоОбслуживание = Выборка.ДатаПроведенияРабот + Время;
		КонецОбслуживание = НачалоОбслуживание + УсловнаяПродолжительность;
		
		ЭлементПланировщика = Планировщик.Элементы.Добавить(НачалоОбслуживание, КонецОбслуживание);
		ЭлементПланировщика.Значение = Выборка.Ссылка;
		ШаблонПланировщика = СтрШаблон("Заявка № %1 от %2, назначен %3", Выборка.Номер, Выборка.Клиент, Выборка.Специалист);
		ЭлементПланировщика.Текст = ШаблонПланировщика;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьКалендарь(Команда)
	
	ОбновитьПланировщикНаСервере();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы 

&НаКлиенте
Процедура ПланировщикПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("ДатаПроведенияРабот", Дата(Начало));
	ЗначенияЗаполнения.Вставить("ВремяНачалаРаботПлан", Дата(Начало));
	ЗначенияЗаполнения.Вставить("ВремяОкончанияРаботПлан", Дата(Конец));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры  

#КонецОбласти



