//++i.skachkova 30.04.2024 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Абонентская плата";
	
	
	НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Стоимость часа работы";
	
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"),ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	
	НовыйЭлемент = Элементы.Добавить("ПериодС", Тип("ПолеФормы"), ГруппаПериод);		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ПериодС";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "Период с";
	
	НовыйЭлемент = Элементы.Добавить("По", Тип("ПолеФормы"), ГруппаПериод);		
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_По";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Заголовок = "По";
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура ВывестиЭлементыНаФорму(Форма)

 Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
	   Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	   Форма.Элементы.АбонентскаяПлата.Видимость = Истина;
	   Форма.Элементы.ПериодС.Видимость = Истина;
	   Форма.Элементы.По.Видимость = Истина;
	   
 Иначе
 	
 	 Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
	 Форма.Элементы.АбонентскаяПлата.Видимость = Ложь;
	 Форма.Элементы.ПериодС.Видимость = Ложь;
	 Форма.Элементы.По.Видимость = Ложь;
	 
 КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  
//--i.skachkova 30.04.2024
